// インクルード -------------------------------------------------------------------------------------
#include "DxLib.h"

#include "scene_title.h"
// 実体宣言 ----------------------------------------------------------------------------------------

// 関数実体 ----------------------------------------------------------------------------------------
// タイトルの初期設定
void title_initialize(void)
{

}

// タイトルの更新処理
void title_update(void)
{

}

// タイトルの描画処理
void title_draw(void)
{

}

// タイトルの終了処理
void title_end(void)
{

}